Revit 2027 API
ColumnAttachment.BaseOrTop Property
 Identifies if this ColumnAttachment is at the base or top of the column.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int BaseOrTop { get; }
Public ReadOnly Property BaseOrTop As Integer
	Get
public:
property int BaseOrTop {
	int get ();
}
member BaseOrTop : int with get
Property Value
Int32
See Also
Reference
ColumnAttachment Class
Autodesk.Revit.DB Namespace